---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsCurveFromOtherElementSketch(Autodesk.Revit.DB.CurveElement)
source: html/62b1086e-f5ee-fca2-8aac-4cf0c54a6a35.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsCurveFromOtherElementSketch Method

Identifies if the given curve element is generated by another element's
 sketch, or if it represents an independent curve element accessible directly
 by the user.

## Syntax (C#)
```csharp
public static bool IsCurveFromOtherElementSketch(
	CurveElement curveElement
)
```

## Parameters
- **curveElement** (`Autodesk.Revit.DB.CurveElement`) - The curve element.

## Returns
True if the curve element was generated by a sketch, false if it is
 independent.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null